
## Purchasing Analysis (Gender)

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load
file_to_load = "Resources/HeroesOfPymoli_Resources_purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

# Player Count

* Display the total number of players

In [2]:
# Find the Total Number of Players
player_count = purchase_data["SN"].unique()
total_players = len(player_count)
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
# Find the number of Unique Items
unique_items = purchase_data["Item Name"].unique()
number_of_unique_items = len(unique_items)
number_of_unique_items

179

In [4]:
# Find the Average Purchase Price
ave_purchase_price = purchase_data["Price"].mean()
ave_purchase_price

3.050987179487176

In [5]:
# Find the Total Number of Purchases
total_purchases = len(purchase_data["Price"])
total_purchases

780

In [6]:
# Find the Total Revenue
total_revenue = sum(purchase_data["Price"])
total_revenue

2379.7699999999973

In [7]:
# Create a summary data frame to hold the results
summary_df = pd.DataFrame([
    {"Number of Unique Items": number_of_unique_items, "Average Price":ave_purchase_price, "Number of Purchases": total_purchases, "Total Revenue": total_revenue}
])

In [8]:
# Display the summary data frame
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [9]:
# Give the displayed data cleaner formatting
summary_df["Average Price"] = summary_df["Average Price"].map("${:.2F}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2F}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
# Sort by SN and drop duplicates to find the unique total number of genders
unique_dem = purchase_data.drop_duplicates("SN", keep='first')
unique_dem

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [11]:
# Find the Count of Male, Female, and other gender Players
gender_count = pd.DataFrame(unique_dem["Gender"].value_counts())
gender_count

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [12]:
# Find the Percentage of Male, Female, and other gender Players
gender_percent = (gender_count / total_players) * 100
gender_percent

                          Gender
Male                   84.027778
Female                 14.062500
Other / Non-Disclosed   1.909722

In [15]:
# Create a summary data frame to hold the results
gender_summary = gender_count.merge(gender_percent, left_index=True, right_index=True)
gender_summary.columns = ["Total Count", "Percentage"]
gender_summary

                       Total Count  Percentage
Male                           484   84.027778
Female                          81   14.062500
Other / Non-Disclosed           11    1.909722

In [16]:
# Give the displayed data cleaner formatting
gender_summary["Percentage"] = gender_summary["Percentage"].map("{:.2F}%".format)
gender_summary

                       Total Count Percentage
Male                           484     84.03%
Female                          81     14.06%
Other / Non-Disclosed           11      1.91%

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [18]:
# Use the initial dataframe to analyse the total purchase data and group it by gender
grouped_gender_purchase = purchase_data.groupby("Gender")
grouped_gender_purchase.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [19]:
# Find the purchase count by gender
pc_gender = pd.DataFrame(grouped_gender_purchase["Purchase ID"].count())
pc_gender

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [20]:
# Find the average purchase price by gender
app_gender = grouped_gender_purchase["Price"].mean()
app_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [21]:
# Find the total purchase value by gender
tpv_gender = grouped_gender_purchase["Price"].sum()
tpv_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [23]:
# To find the unique purchase data, group the unique dataframe by gender 
grouped_unique_gender = unique_dem.groupby("Gender")
grouped_unique_gender.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                          81   81   81       81         81     81
Male                           484  484  484      484        484    484
Other / Non-Disclosed           11   11   11       11         11     11

In [25]:
# Find the unique gender count from the unique dataframe grouped by gender
unique_gender_count = grouped_unique_gender["SN"].count()
unique_gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [26]:
# Find the average total purchase per person by gender using the unique gender count
atpp_gender = pd.DataFrame(tpv_gender / unique_gender_count)
atpp_gender

                              0
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [27]:
# Display the summary data frame
gender_purchase_summary = pc_gender.merge(app_gender, left_index=True, right_index=True)
gender_purchase_summary = gender_purchase_summary.merge(tpv_gender, left_index=True, right_index=True)
summary_gender_purchase = gender_purchase_summary.merge(atpp_gender, left_index=True, right_index=True)
summary_gender_purchase.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Ave Total Purchase per Person"]
summary_gender_purchase

,Purchase Count,Average Purchase Price,Total Purchase Value,Ave Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [28]:
#  Give the displayed data cleaner formatting
summary_gender_purchase["Average Purchase Price"] = summary_gender_purchase["Average Purchase Price"].map("${:.2F}".format)
summary_gender_purchase["Total Purchase Value"] = summary_gender_purchase["Total Purchase Value"].map("${:,.2F}".format)
summary_gender_purchase["Ave Total Purchase per Person"] = summary_gender_purchase["Ave Total Purchase per Person"].map("${:.2F}".format)
# Display the summary data frame
summary_gender_purchase

,Purchase Count,Average Purchase Price,Total Purchase Value,Ave Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [29]:
# Use the initial dataframe to analyse the data and reduce the columns to display only the relevant ones 
unique_age_dem = pd.DataFrame(unique_dem[["SN", "Age", "Price"]])
unique_age_dem

                SN  Age  Price
0          Lisim78   20   3.53
1      Lisovynya38   40   1.56
2       Ithergue48   24   4.88
3    Chamassasya86   24   3.27
4        Iskosia90   23   1.44
..             ...  ...    ...
773         Hala31   21   1.02
774     Jiskjask80   11   4.19
775     Aethedru70   21   3.54
777     Yathecal72   20   3.46
778        Sisur91    7   4.19

[576 rows x 3 columns]

In [30]:
# Establish bins for the age ranges
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

# Categorize the existing players using the age bins
unique_age_dem["Age Ranges"] = pd.cut(unique_age_dem["Age"], bins, labels=group_names, include_lowest=True)
unique_age_dem

                SN  Age  Price Age Ranges
0          Lisim78   20   3.53      20-24
1      Lisovynya38   40   1.56        40+
2       Ithergue48   24   4.88      20-24
3    Chamassasya86   24   3.27      20-24
4        Iskosia90   23   1.44      20-24
..             ...  ...    ...        ...
773         Hala31   21   1.02      20-24
774     Jiskjask80   11   4.19      10-14
775     Aethedru70   21   3.54      20-24
777     Yathecal72   20   3.46      20-24
778        Sisur91    7   4.19        <10

[576 rows x 4 columns]

In [31]:
# Group the data by age range
grouped_unique_agerange = unique_age_dem.groupby("Age Ranges")
grouped_unique_agerange.count()

             SN  Age  Price
Age Ranges
<10          17   17     17
10-14        22   22     22
15-19       107  107    107
20-24       258  258    258
25-29        77   77     77
30-34        52   52     52
35-39        31   31     31
40+          12   12     12

In [32]:
# Calculate the numbers/counts by age range
unique_agerange_count = pd.DataFrame(grouped_unique_agerange["SN"].count())
unique_agerange_count

             SN
Age Ranges
<10          17
10-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40+          12

In [33]:
# Calculate the percentages by age range
unique_agerange_percent = (unique_agerange_count / total_players) * 100
unique_agerange_percent

                   SN
Age Ranges
<10          2.951389
10-14        3.819444
15-19       18.576389
20-24       44.791667
25-29       13.368056
30-34        9.027778
35-39        5.381944
40+          2.083333

In [34]:
# Create a summary data frame to hold the results
unique_age_summary = unique_agerange_count.merge(unique_agerange_percent, left_index=True, right_index=True)
unique_age_summary.columns = ["Total Count", "Percentage"]
unique_age_summary

            Total Count  Percentage
Age Ranges
<10                  17    2.951389
10-14                22    3.819444
15-19               107   18.576389
20-24               258   44.791667
25-29                77   13.368056
30-34                52    9.027778
35-39                31    5.381944
40+                  12    2.083333

In [35]:
# Round the percentage column to two decimal points
unique_age_summary["Percentage"] = unique_age_summary["Percentage"].map("{:.2F}%".format)
# Display Age Demographics Table
unique_age_summary

            Total Count Percentage
Age Ranges
<10                  17      2.95%
10-14                22      3.82%
15-19               107     18.58%
20-24               258     44.79%
25-29                77     13.37%
30-34                52      9.03%
35-39                31      5.38%
40+                  12      2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [36]:
# Use the initial dataframe to analyse the data
all_age_dem = pd.DataFrame(purchase_data[["SN", "Age", "Price"]])
all_age_dem

                SN  Age  Price
0          Lisim78   20   3.53
1      Lisovynya38   40   1.56
2       Ithergue48   24   4.88
3    Chamassasya86   24   3.27
4        Iskosia90   23   1.44
..             ...  ...    ...
775     Aethedru70   21   3.54
776         Iral74   21   1.63
777     Yathecal72   20   3.46
778        Sisur91    7   4.19
779      Ennrian78   24   4.60

[780 rows x 3 columns]

In [37]:
# Bin the data frame by age
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
all_age_dem["Age Ranges"] = pd.cut(purchase_data["Age"], bins, labels=group_names, include_lowest=True)
all_age_dem

                SN  Age  Price Age Ranges
0          Lisim78   20   3.53      20-24
1      Lisovynya38   40   1.56        40+
2       Ithergue48   24   4.88      20-24
3    Chamassasya86   24   3.27      20-24
4        Iskosia90   23   1.44      20-24
..             ...  ...    ...        ...
775     Aethedru70   21   3.54      20-24
776         Iral74   21   1.63      20-24
777     Yathecal72   20   3.46      20-24
778        Sisur91    7   4.19        <10
779      Ennrian78   24   4.60      20-24

[780 rows x 4 columns]

In [38]:
# Group the data by age range
grouped_all_agerange = all_age_dem.groupby("Age Ranges")
grouped_all_agerange.count()

             SN  Age  Price
Age Ranges
<10          23   23     23
10-14        28   28     28
15-19       136  136    136
20-24       365  365    365
25-29       101  101    101
30-34        73   73     73
35-39        41   41     41
40+          13   13     13

In [39]:
# Find the purchase count by age range
pc_age = pd.DataFrame(grouped_all_agerange["SN"].count())
pc_age

             SN
Age Ranges
<10          23
10-14        28
15-19       136
20-24       365
25-29       101
30-34        73
35-39        41
40+          13

In [40]:
# Find the average purchase price by age range
app_age = grouped_all_agerange["Price"].mean()
app_age

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [41]:
# Find the total purchase value by age range
tpv_age = grouped_all_agerange["Price"].sum()
tpv_age

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [42]:
# Use the unique dataframe to find the unique age count
unique_age_count = grouped_all_agerange["SN"].count()
unique_age_count

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [43]:
# Find the average total purchase per person by age range using the unique age count
atpp_age = pd.DataFrame(tpv_age / unique_age_count)
atpp_age

                   0
Age Ranges
<10         3.353478
10-14       2.956429
15-19       3.035956
20-24       3.052219
25-29       2.900990
30-34       2.931507
35-39       3.601707
40+         2.941538

In [44]:
# Create a summary dataframe to hold the results
age_purchase_summary = pc_age.merge(app_age, left_index=True, right_index=True)
age_purchase_summary = age_purchase_summary.merge(tpv_age, left_index=True, right_index=True)
summary_age_purchase = age_purchase_summary.merge(atpp_age, left_index=True, right_index=True)
summary_age_purchase.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Ave Total Purchase per Person"]
summary_age_purchase

,Purchase Count,Average Purchase Price,Total Purchase Value,Ave Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,3.353478
10-14,28,2.956429,82.78,2.956429
15-19,136,3.035956,412.89,3.035956
20-24,365,3.052219,1114.06,3.052219
25-29,101,2.900990,293.00,2.900990
30-34,73,2.931507,214.00,2.931507
35-39,41,3.601707,147.67,3.601707
40+,13,2.941538,38.24,2.941538

In [45]:
# Give the displayed data cleaner formatting
summary_age_purchase["Average Purchase Price"] = summary_age_purchase["Average Purchase Price"].map("${:.2F}".format)
summary_age_purchase["Total Purchase Value"] = summary_age_purchase["Total Purchase Value"].map("${:,.2F}".format)
summary_age_purchase["Ave Total Purchase per Person"] = summary_age_purchase["Ave Total Purchase per Person"].map("${:.2F}".format)
# Display the summary data frame
summary_age_purchase

,Purchase Count,Average Purchase Price,Total Purchase Value,Ave Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$3.35
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,"$1,114.06",$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [46]:
# Use the initial dataframe to analyse the data
spenders_df = purchase_data[["SN", "Purchase ID", "Price", "Age", "Gender"]]
spenders_df

                SN  Purchase ID  Price  Age  Gender
0          Lisim78            0   3.53   20    Male
1      Lisovynya38            1   1.56   40    Male
2       Ithergue48            2   4.88   24    Male
3    Chamassasya86            3   3.27   24    Male
4        Iskosia90            4   1.44   23    Male
..             ...          ...    ...  ...     ...
775     Aethedru70          775   3.54   21  Female
776         Iral74          776   1.63   21    Male
777     Yathecal72          777   3.46   20    Male
778        Sisur91          778   4.19    7    Male
779      Ennrian78          779   4.60   24    Male

[780 rows x 5 columns]

In [47]:
# Group the dataset by customer name
big_spenders = spenders_df.groupby("SN")
big_spenders.count()

               Purchase ID  Price  Age  Gender
SN
Adairialis76             1      1    1       1
Adastirin33              1      1    1       1
Aeda94                   1      1    1       1
Aela59                   1      1    1       1
Aelaria33                1      1    1       1
...                    ...    ...  ...     ...
Yathecal82               3      3    3       3
Yathedeu43               2      2    2       2
Yoishirrala98            1      1    1       1
Zhisrisu83               2      2    2       2
Zontibe81                3      3    3       3

[576 rows x 4 columns]

In [48]:
# Find the puchase count by customer name
pc_bigspenders = pd.DataFrame(big_spenders["Purchase ID"].count())
pc_bigspenders

               Purchase ID
SN
Adairialis76             1
Adastirin33              1
Aeda94                   1
Aela59                   1
Aelaria33                1
...                    ...
Yathecal82               3
Yathedeu43               2
Yoishirrala98            1
Zhisrisu83               2
Zontibe81                3

[576 rows x 1 columns]

In [49]:
# Find the average purchase per person by customer name
app_bigspenders = big_spenders["Price"].mean()
app_bigspenders

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [50]:
# Find the total purchase value by customer name
tpv_bigspenders = big_spenders["Price"].sum()
tpv_bigspenders

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [51]:
# Create a summary table to hold the results
spender_purchase_summary = pc_bigspenders.merge(app_bigspenders, left_index=True, right_index=True)
summary_spender_purchase = spender_purchase_summary.merge(tpv_bigspenders, left_index=True, right_index=True)
summary_spender_purchase.columns = ["Purchase Count", "Average Purchase Price", "Total Purchase Value"]
summary_spender_purchase

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [52]:
# Sort the purchase count in descending order to find the top spender
summary_spender_purchase = summary_spender_purchase.sort_values("Purchase Count", ascending=False).reset_index()
summary_spender_purchase.head(5)

            SN  Purchase Count  Average Purchase Price  Total Purchase Value
0    Lisosia93               5                3.792000                 18.96
1       Iral74               4                3.405000                 13.62
2  Idastidru52               4                3.862500                 15.45
3       Asur53               3                2.480000                  7.44
4    Inguron55               3                3.703333                 11.11

In [53]:
# Give the displayed data cleaner formatting
summary_spender_purchase["Average Purchase Price"] = summary_spender_purchase["Average Purchase Price"].map("${:.2F}".format)
summary_spender_purchase["Total Purchase Value"] = summary_spender_purchase["Total Purchase Value"].map("${:.2F}".format)
summary_spender_purchase.head(5)

            SN  Purchase Count Average Purchase Price Total Purchase Value
0    Lisosia93               5                  $3.79               $18.96
1       Iral74               4                  $3.40               $13.62
2  Idastidru52               4                  $3.86               $15.45
3       Asur53               3                  $2.48                $7.44
4    Inguron55               3                  $3.70               $11.11

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [54]:
# Use the initial dataframe to analyse the data
items_df = pd.DataFrame(purchase_data[["Item ID", "Item Name", "Price"]])
items_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [55]:
# Group the dataframe by Item ID and Item Name
pop_items = items_df.groupby(["Item ID", "Item Name"])
pop_items.count()

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

In [56]:
# Find the purchase count of the items
pc_pop_items = pd.DataFrame(pop_items["Item ID"].count())
pc_pop_items

                                                      Item ID
Item ID Item Name
0       Splinter                                            4
1       Crucifer                                            4
2       Verdict                                             6
3       Phantomlight                                        6
4       Bloodlord's Fetish                                  5
...                                                       ...
178     Oathbreaker, Last Hope of the Breaking Storm       12
179     Wolf, Promise of the Moonwalker                     6
181     Reaper's Toll                                       5
182     Toothpick                                           3
183     Dragon's Greatsword                                 3

[179 rows x 1 columns]

In [57]:
# Display the items' prices
app_pop_items = pop_items["Price"].mean()
app_pop_items

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [58]:
# Find the total purchase value by item
tpv_pop_items = pop_items["Price"].sum()
tpv_pop_items

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [59]:
# Create a summary table to store the data
item_purchase_summary = pc_pop_items.merge(app_pop_items, left_index=True, right_index=True)
summary_pop_items = item_purchase_summary.merge(tpv_pop_items, left_index=True, right_index=True)
summary_pop_items.columns = ["Purchase Count", "Item Price", "Total Purchase Value"]
summary_pop_items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [60]:
# Sort the items by purchase count to find the most popular items
summary_pop_items = summary_pop_items.sort_values("Purchase Count", ascending=False).reset_index()
summary_pop_items.head(5)

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,92,Final Critic,13,4.614615,59.99
1,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
2,145,Fiery Glass Crusader,9,4.580000,41.22
3,132,Persuasion,9,3.221111,28.99
4,108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [61]:
# Give the displayed data cleaner formatting
summary_pop_items["Item Price"] = summary_pop_items["Item Price"].map("${:.2F}".format)
summary_pop_items["Total Purchase Value"] = summary_pop_items["Total Purchase Value"].map("${:.2F}".format)
summary_pop_items.head(5)

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,92,Final Critic,13,$4.61,$59.99
1,178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
2,145,Fiery Glass Crusader,9,$4.58,$41.22
3,132,Persuasion,9,$3.22,$28.99
4,108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [62]:
# Use the previous table to create a new table that shows the most profitable item by sorting the Total Purchase Value in descending order
summary_prof_items = pd.DataFrame(summary_pop_items.sort_values("Total Purchase Value", ascending=False))
summary_prof_items

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
164,63,Stormfury Mace,2,$4.99,$9.98
65,29,"Chaos, Ender of the End",5,$1.98,$9.90
148,173,Stormfury Longsword,2,$4.93,$9.86
111,38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48
35,143,Frenzied Scimitar,6,$1.56,$9.36
...,...,...,...,...,...
145,106,Crying Steel Sickle,3,$3.41,$10.23
126,151,Severance,3,$3.40,$10.20
17,110,Suspension,7,$1.44,$10.08
177,104,Gladiator's Glaive,1,$1.93,$1.93
174,42,The Decapitator,1,$1.75,$1.75

In [63]:
# Display the summary table
summary_prof_items.head(5)

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
164,63,Stormfury Mace,2,$4.99,$9.98
65,29,"Chaos, Ender of the End",5,$1.98,$9.90
148,173,Stormfury Longsword,2,$4.93,$9.86
111,38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48
35,143,Frenzied Scimitar,6,$1.56,$9.36

In [66]:
# Include a written description of three observable trends based on the data.

# 1. The gender purchase summary shows us that 84% of the shop's sales is generated by males, more than any other gender. The average purchase price gives an indication that the price range of the items are within the price range all genders are attracted to which the average total purchase per person confirms.

# 2. The age purchase summary reveals that the highest percentage of customers are between ages 20-24, 44% out of the 8 age ranges listed. The 20-24 age group has generated more than double the amount of sales from the second highest group that generated sales who are aged between 15-19 and accounted for 18.5% of the sales. 

# 3. The top spender spent a total of $18.96 on 5 purchases averaging $3.79 per item. The most popular item sold 13 units and is priced at $4.61 which is also the most profitable.